; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v5 - type_2 ?v1 - type_1)
 	      (pred_1 ?v6 - object ?v1 - type_1)
	      (pred_2 ?v5 - type_2 ?v2 - type_3)
	      (pred_4 ?v5 - type_2 ?v6 - object ?v2 - type_3))

   (:action op_2
       :parameters  (?v5 - type_2 ?v7 ?v4 - type_1)
       :precondition (and  (pred_3 ?v5 ?v7))
       :effect (and  (pred_3 ?v5 ?v4)
		     (not (pred_3 ?v5 ?v7))))

   (:action op_3
       :parameters (?v5 - type_2 ?v8 - object ?v3 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v3) (pred_3 ?v5 ?v3) (pred_2 ?v5 ?v2))
       :effect (and (pred_4 ?v5 ?v8 ?v2)
		    (not (pred_1 ?v8 ?v3)) 
		    (not (pred_2 ?v5 ?v2))))

   (:action op_1
       :parameters (?v5 - type_2 ?v8 - object ?v3 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v8 ?v2) (pred_3 ?v5 ?v3))
       :effect (and (pred_1 ?v8 ?v3)
		    (pred_2 ?v5 ?v2)
		    (not (pred_4 ?v5 ?v8 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_2
obj_02 obj_09 - type_3
obj_06 obj_03 obj_01 - type_1
obj_07 obj_08 obj_05 - object)
(:init
(pred_3 obj_04 obj_01)
(pred_2 obj_04 obj_02)
(pred_2 obj_04 obj_09)
(pred_1 obj_07 obj_06)
(pred_1 obj_08 obj_01)
(pred_1 obj_05 obj_06)
)
(:goal
(and
(pred_1 obj_07 obj_03)
(pred_1 obj_08 obj_01)
(pred_1 obj_05 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_04 ?b obj_09))))
)
)

; plan
1. (op_2 obj_04 obj_01 obj_06)
   deleted: (pred_3 obj_04 obj_01)
   added: (pred_3 obj_04 obj_06)
   goals met: 2 of 3
2. (op_3 obj_04 obj_07 obj_06 obj_02)
   deleted: (pred_1 obj_07 obj_06) (pred_2 obj_04 obj_02)
   added: (pred_4 obj_04 obj_07 obj_02)
   goals met: 2 of 3
3. (op_2 obj_04 obj_06 obj_03)
   deleted: (pred_3 obj_04 obj_06)
   added: (pred_3 obj_04 obj_03)
   goals met: 2 of 3
4. (op_1 obj_04 obj_07 obj_03 obj_02)
   deleted: (pred_4 obj_04 obj_07 obj_02)
   added: (pred_1 obj_07 obj_03) (pred_2 obj_04 obj_02)
   goals met: 3 of 3
